import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  title: "srt-wiki",
  description: "srt-wiki",
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: 'Home', link: '/' },
    ],

    sidebar: [
      {
        text: '简介',
        items: [
          { text: '简介', link: '/简介' },
        ]
      },
      {
        text: '1.杭电生存指南（最重要模块）',
        items: [
          { text: '1.1人文社科的重要性（韩健夫老师寄语）', link: '/1.杭电生存指南/1.1人文社科的重要性（韩健夫老师寄语）' },
          { text: '1.2竞赛指北', link: '/1.杭电生存指南/1.2竞赛指北' },
          { text: '1.3导师选择', link: '/1.杭电生存指南/1.3导师选择' },
          { text: '1.4小心项目陷阱', link: '/1.杭电生存指南/1.4小心项目陷阱' },
          { text: '1.5小组作业避雷指南', link: '/1.杭电生存指南/1.5小组作业避雷指南' },
          { text: '1.6正确解读GPA', link: '/1.杭电生存指南/1.6正确解读GPA' },
          { text: '1.7杭电出国自救指南', link: '/1.杭电生存指南/1.7杭电出国自救指南' },
          { text: '1.8转专业二三事', link: '/1.杭电生存指南/1.8转专业二三事' },
          { text: '1.9问题专题：好想进入实验室', link: '/1.杭电生存指南/1.9问题专题：好想进入实验室' },
          { text: '1.10如何读论文', link: '/1.杭电生存指南/1.10如何读论文' },
        ]
      },
      {
        text: '2.高效学习',
        items: [
          { text: '2.高效学习', link: '/2.高效学习/2.高效学习' },
          { text: '2.1高效的前提：摆脱高中思维', link: '/2.高效学习/2.1高效的前提：摆脱高中思维' },
          { text: '2.1.1悲壮的学习方式', link: '/2.高效学习/2.1.1悲壮的学习方式' },
          { text: '2.1.2浮躁的心理状态', link: '/2.高效学习/2.1.2浮躁的心理状态' },
          { text: '2.1.3错误的提问姿态', link: '/2.高效学习/2.1.3错误的提问姿态' },
          { text: '2.1.4书籍的盲目崇拜', link: '/2.高效学习/2.1.4书籍的盲目崇拜' },
          { text: '2.1.5错误的学习配比', link: '/2.高效学习/2.1.5错误的学习配比' },
          { text: '2.2优雅的使用工具', link: '/2.高效学习/2.2优雅的使用工具' },
          { text: '2.3高效的信息检索', link: '/2.高效学习/2.3高效的信息检索' },
          { text: '2.3.1阅读文档（B百度爬）', link: '/2.高效学习/2.3.1阅读文档（B百度爬）' },
          { text: '2.3.2检索论文核心内容', link: '/2.高效学习/2.3.2检索论文核心内容' },
          { text: '2.3.3优秀的开源社区', link: '/2.高效学习/2.3.3优秀的开源社区' },
          { text: '补充：为什么不要用百度', link: '/2.高效学习/补充：为什么不要用百度' },
          { text: '2.4提问的艺术', link: '/2.高效学习/2.4提问的艺术' },
          { text: '2.5优雅的记笔记', link: '/2.高效学习/2.5优雅的记笔记' },
          { text: '2.6以理工科的方式阅读英语', link: '/2.高效学习/2.6以理工科的方式阅读英语' },
        ]
      },
      {
        text: '3.编程思维体系构建',
        items: [
          { text: '3.编程思维体系构建', link: '/3.编程思维体系构建/3.编程思维体系构建' },
          { text: '3.0 编程入门之道', link: '/3.编程思维体系构建/3.0 编程入门之道' },
          { text: '3.1该使用哪个编辑器？？？', link: '/3.编程思维体系构建/3.1该使用哪个编辑器？？？' },
          { text: '3.2算法杂谈', link: '/3.编程思维体系构建/3.2算法杂谈' },
          { text: '3.2.1为什么要选择ACM——谈谈我与ACM', link: '/3.编程思维体系构建/3.2.1为什么要选择ACM——谈谈我与ACM' },
          { text: '3.2.2手把手教你学算法——如何使用OJ（Online Judge）', link: '/3.编程思维体系构建/3.2.2手把手教你学算法——如何使用OJ（Online Judge）' },
          { text: '3.3如何选择编程语言', link: '/3.编程思维体系构建/3.3如何选择编程语言' },
          { text: '3.4C语言', link: '/3.编程思维体系构建/3.4C语言' },
          { text: '3.4.1FAQ：常见问题', link: '/3.编程思维体系构建/3.4.1FAQ：常见问题' },
          { text: '3.4.2用什么写 C 语言', link: '/3.编程思维体系构建/3.4.2用什么写 C 语言' },
          { text: '3.4.3解决编程问题的普适性过程', link: '/3.编程思维体系构建/3.4.3解决编程问题的普适性过程' },
          { text: '3.4.4C语言前置概念学习', link: '/3.编程思维体系构建/3.4.4C语言前置概念学习' },
          { text: '3.4.5阶段一：编程属性', link: '/3.编程思维体系构建/3.4.5阶段一：编程属性' },
          { text: '3.4.5.1C语言自测标准——链表', link: '/3.编程思维体系构建/3.4.5.1C语言自测标准——链表' },
          { text: '3.4.6阶段二：文字冒险（cool）', link: '/3.编程思维体系构建/3.4.6阶段二：文字冒险（cool）' },
          { text: '3.4.6.1.开始冒险', link: '/3.编程思维体系构建/3.4.6.1.开始冒险' },
          { text: '3.4.6.2.探索未知', link: '/3.编程思维体系构建/3.4.6.2.探索未知' },
          { text: '3.4.6.3.指明地点', link: '/3.编程思维体系构建/3.4.6.3.指明地点' },
          { text: '3.4.6.4.创建对象', link: '/3.编程思维体系构建/3.4.6.4.创建对象' },
          { text: '3.4.6.5.捡起物品', link: '/3.编程思维体系构建/3.4.6.5.捡起物品' },
          { text: '3.4.6.6.绘制地图', link: '/3.编程思维体系构建/3.4.6.6.绘制地图' },
          { text: '3.4.6.7.增大距离', link: '/3.编程思维体系构建/3.4.6.7.增大距离' },
          { text: '3.4.6.8.移动方向', link: '/3.编程思维体系构建/3.4.6.8.移动方向' },
          { text: '3.4.6.9.练习：生成代码', link: '/3.编程思维体系构建/3.4.6.9.练习：生成代码' },
          { text: '3.4.6.10.增添属性', link: '/3.编程思维体系构建/3.4.6.10.增添属性' },
          { text: '3.4.6.11.设置条件', link: '/3.编程思维体系构建/3.4.6.11.设置条件' },
          { text: '3.4.6.12.开启关闭', link: '/3.编程思维体系构建/3.4.6.12.开启关闭' },
          { text: '3.4.6.13.编写解析器', link: '/3.编程思维体系构建/3.4.6.13.编写解析器' },
          { text: '3.4.6.14.丰富命令', link: '/3.编程思维体系构建/3.4.6.14.丰富命令' },
          { text: '3.4.6.15.赋予明暗', link: '/3.编程思维体系构建/3.4.6.15.赋予明暗' },
          { text: '3.4.6.16.结语：你终将自由', link: '/3.编程思维体系构建/3.4.6.16.结语：你终将自由' },
          { text: '3.4.7C基础知识杂谈', link: '/3.编程思维体系构建/3.4.7C基础知识杂谈' },
          { text: '3.4.7.1GDB初探索（编程可阅览）', link: '/3.编程思维体系构建/3.4.7.1GDB初探索（编程可阅览）' },
          { text: '3.4.7.1.1调试理论', link: '/3.编程思维体系构建/3.4.7.1.1调试理论' },
          { text: '3.4.7.2C的历史问题：undefined behavior', link: '/3.编程思维体系构建/3.4.7.2C的历史问题：undefined behavior' },
          { text: '3.4.7.3C编译器干了什么', link: '/3.编程思维体系构建/3.4.7.3C编译器干了什么' },
          { text: '3.4.7.4Inline Assembly与链接加载', link: '/3.编程思维体系构建/3.4.7.4Inline Assembly与链接加载' },
        ]
      }
    ],

    socialLinks: [
      { icon: 'github', link: 'https://github.com/vuejs/vitepress' }
    ]
  }
})
