import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  lang: 'zh-CN',
  title: "HDU-CS-WIKI",
  description: "HDU计算机科学讲义",
  lastUpdated: true,
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: '首页', link: '/' },
    ],

    sidebar: [
      {
        text: '简介',
        collapsed: true,
        items: [
          { text: '简介', link: '/简介' },
        ]
      },
      {
        text: '1.杭电生存指南（最重要模块）',
        collapsed: true,
        items: [
          { text: '1.1人文社科的重要性（韩健夫老师寄语）', link: '/1.杭电生存指南/1.1人文社科的重要性（韩健夫老师寄语）' },
          { text: '1.2竞赛指北', link: '/1.杭电生存指南/1.2竞赛指北' },
          { text: '1.3导师选择', link: '/1.杭电生存指南/1.3导师选择' },
          { text: '1.4小心项目陷阱', link: '/1.杭电生存指南/1.4小心项目陷阱' },
          { text: '1.5小组作业避雷指南', link: '/1.杭电生存指南/1.5小组作业避雷指南' },
          { text: '1.6正确解读GPA', link: '/1.杭电生存指南/1.6正确解读GPA' },
          { text: '1.7杭电出国自救指南', link: '/1.杭电生存指南/1.7杭电出国自救指南' },
          { text: '1.8转专业二三事', link: '/1.杭电生存指南/1.8转专业二三事' },
          { text: '1.9问题专题：好想进入实验室', link: '/1.杭电生存指南/1.9问题专题：好想进入实验室' },
          { text: '1.10如何读论文', link: '/1.杭电生存指南/1.10如何读论文' },
        ]
      },
      {
        text: '2.高效学习',
        collapsed: true,
        items: [
          { text: '2.高效学习', link: '/2.高效学习/2.高效学习' },
          {
            text: '2.1高效的前提：摆脱高中思维',
            collapsed: true,
            items: [
              { text: '2.1高效的前提：摆脱高中思维', link: '/2.高效学习/2.1高效的前提：摆脱高中思维' },
              { text: '2.1.1悲壮的学习方式', link: '/2.高效学习/2.1.1悲壮的学习方式' },
              { text: '2.1.2浮躁的心理状态', link: '/2.高效学习/2.1.2浮躁的心理状态' },
              { text: '2.1.3错误的提问姿态', link: '/2.高效学习/2.1.3错误的提问姿态' },
              { text: '2.1.4书籍的盲目崇拜', link: '/2.高效学习/2.1.4书籍的盲目崇拜' },
              { text: '2.1.5错误的学习配比', link: '/2.高效学习/2.1.5错误的学习配比' },
            ]
          },
          { text: '2.2优雅的使用工具', link: '/2.高效学习/2.2优雅的使用工具' },
          {
            text: '2.3高效的信息检索',
            collapsed: true,
            items: [
              { text: '2.3高效的信息检索', link: '/2.高效学习/2.3高效的信息检索' },
              { text: '2.3.1阅读文档（B百度爬）', link: '/2.高效学习/2.3.1阅读文档（B百度爬）' },
              { text: '2.3.2检索论文核心内容', link: '/2.高效学习/2.3.2检索论文核心内容' },
              { text: '2.3.3优秀的开源社区', link: '/2.高效学习/2.3.3优秀的开源社区' },
              { text: '补充：为什么不要用百度', link: '/2.高效学习/补充：为什么不要用百度' },
            ]
          },
          { text: '2.4提问的艺术', link: '/2.高效学习/2.4提问的艺术' },
          { text: '2.5优雅的记笔记', link: '/2.高效学习/2.5优雅的记笔记' },
          { text: '2.6以理工科的方式阅读英语', link: '/2.高效学习/2.6以理工科的方式阅读英语' },
        ]
      },
      {
        text: '3.编程思维体系构建',
        collapsed: true,
        items: [
          { text: '3.编程思维体系构建', link: '/3.编程思维体系构建/3.编程思维体系构建' },
          { text: '3.0 编程入门之道', link: '/3.编程思维体系构建/3.0 编程入门之道' },
          { text: '3.1该使用哪个编辑器？？？', link: '/3.编程思维体系构建/3.1该使用哪个编辑器？？？' },
          {
            text: '3.2算法杂谈',
            collapsed: true,
            items: [
              { text: '3.2算法杂谈', link: '/3.编程思维体系构建/3.2算法杂谈' },
              { text: '3.2.1为什么要选择ACM——谈谈我与ACM', link: '/3.编程思维体系构建/3.2.1为什么要选择ACM——谈谈我与ACM' },
              { text: '3.2.2手把手教你学算法——如何使用OJ（Online Judge）', link: '/3.编程思维体系构建/3.2.2手把手教你学算法——如何使用OJ（Online Judge）' },
            ]
          },
          { text: '3.3如何选择编程语言', link: '/3.编程思维体系构建/3.3如何选择编程语言' },
          {
            text: '3.4C语言',
            collapsed: true,
            items: [
              { text: '3.4C语言', link: '/3.编程思维体系构建/3.4C语言' },
              { text: '3.4.1FAQ：常见问题', link: '/3.编程思维体系构建/3.4.1FAQ：常见问题' },
              { text: '3.4.2用什么写 C 语言', link: '/3.编程思维体系构建/3.4.2用什么写 C 语言' },
              { text: '3.4.3解决编程问题的普适性过程', link: '/3.编程思维体系构建/3.4.3解决编程问题的普适性过程' },
              { text: '3.4.4C语言前置概念学习', link: '/3.编程思维体系构建/3.4.4C语言前置概念学习' },
              {
                text: '3.4.5阶段一：编程属性',
                collapsed: true,
                items: [
                  { text: '3.4.5阶段一：编程属性', link: '/3.编程思维体系构建/3.4.5阶段一：编程属性' },
                  { text: '3.4.5.1C语言自测标准——链表', link: '/3.编程思维体系构建/3.4.5.1C语言自测标准——链表' },
                ]
              },
              {
                text: '3.4.6阶段二：文字冒险（cool）',
                collapsed: true,
                items: [
                  { text: '3.4.6阶段二：文字冒险（cool）', link: '/3.编程思维体系构建/3.4.6阶段二：文字冒险（cool）' },
                  { text: '3.4.6.1.开始冒险', link: '/3.编程思维体系构建/3.4.6.1.开始冒险' },
                  { text: '3.4.6.2.探索未知', link: '/3.编程思维体系构建/3.4.6.2.探索未知' },
                  { text: '3.4.6.3.指明地点', link: '/3.编程思维体系构建/3.4.6.3.指明地点' },
                  { text: '3.4.6.4.创建对象', link: '/3.编程思维体系构建/3.4.6.4.创建对象' },
                  { text: '3.4.6.5.捡起物品', link: '/3.编程思维体系构建/3.4.6.5.捡起物品' },
                  { text: '3.4.6.6.绘制地图', link: '/3.编程思维体系构建/3.4.6.6.绘制地图' },
                  { text: '3.4.6.7.增大距离', link: '/3.编程思维体系构建/3.4.6.7.增大距离' },
                  { text: '3.4.6.8.移动方向', link: '/3.编程思维体系构建/3.4.6.8.移动方向' },
                  { text: '3.4.6.9.练习：生成代码', link: '/3.编程思维体系构建/3.4.6.9.练习：生成代码' },
                  { text: '3.4.6.10.增添属性', link: '/3.编程思维体系构建/3.4.6.10.增添属性' },
                  { text: '3.4.6.11.设置条件', link: '/3.编程思维体系构建/3.4.6.11.设置条件' },
                  { text: '3.4.6.12.开启关闭', link: '/3.编程思维体系构建/3.4.6.12.开启关闭' },
                  { text: '3.4.6.13.编写解析器', link: '/3.编程思维体系构建/3.4.6.13.编写解析器' },
                  { text: '3.4.6.14.丰富命令', link: '/3.编程思维体系构建/3.4.6.14.丰富命令' },
                  { text: '3.4.6.15.赋予明暗', link: '/3.编程思维体系构建/3.4.6.15.赋予明暗' },
                  { text: '3.4.6.16.结语：你终将自由', link: '/3.编程思维体系构建/3.4.6.16.结语：你终将自由' },
                  { text: '3.4.7C基础知识杂谈', link: '/3.编程思维体系构建/3.4.7C基础知识杂谈' },
                  { text: '3.4.7.1GDB初探索（编程可阅览）', link: '/3.编程思维体系构建/3.4.7.1GDB初探索（编程可阅览）' },
                  { text: '3.4.7.1.1调试理论', link: '/3.编程思维体系构建/3.4.7.1.1调试理论' },
                  { text: '3.4.7.2C的历史问题：undefined behavior', link: '/3.编程思维体系构建/3.4.7.2C的历史问题：undefined behavior' },
                  { text: '3.4.7.3C编译器干了什么', link: '/3.编程思维体系构建/3.4.7.3C编译器干了什么' },
                  { text: '3.4.7.4Inline Assembly与链接加载', link: '/3.编程思维体系构建/3.4.7.4Inline Assembly与链接加载' },
                ]
              },
            ]
          },
          {
            text: '3.5git与github',
            collapsed: true,
            items: [
              { text: '3.5git与github', link: '/3.编程思维体系构建/3.5git与github' },
            ]
          },
          {
            text: '3.6Python（灵巧的胶水）',
            collapsed: true,
            items: [
              { text: '3.6Python（灵巧的胶水）', link: '/3.编程思维体系构建/3.6Python（灵巧的胶水）' },
              { text: '3.6.1从CS61A看编程语言学习', link: '/3.编程思维体系构建/3.6.1从CS61A看编程语言学习' },
              { text: '3.6.2环境配置', link: '/3.编程思维体系构建/3.6.2环境配置' },
              { text: '3.6.3安装python', link: '/3.编程思维体系构建/3.6.3安装python' },
              {
                text: '3.6.4Python for fun',
                collapsed: true,
                items: [
                  { text: '3.6.4Python for fun', link: '/3.编程思维体系构建/3.6.4Python for fun' },
                  { text: '3.6.4.0阶段零：Python解释器', link: '/3.编程思维体系构建/3.6.4.0阶段零：Python解释器' },
                  { text: '3.6.4.1阶段一：熟悉语句', link: '/3.编程思维体系构建/3.6.4.1阶段一：熟悉语句' },
                  { text: '3.6.4.2阶段二：递归操作', link: '/3.编程思维体系构建/3.6.4.2阶段二：递归操作' },
                  { text: '3.6.4.3阶段三：数据抽象', link: '/3.编程思维体系构建/3.6.4.3阶段三：数据抽象' },
                  { text: '3.6.4.4阶段四：高阶函数', link: '/3.编程思维体系构建/3.6.4.4阶段四：高阶函数' },
                  { text: '3.6.4.5阶段五：迭代生成', link: '/3.编程思维体系构建/3.6.4.5阶段五：迭代生成' },
                  { text: '3.6.4.6结语', link: '/3.编程思维体系构建/3.6.4.6结语' },
                  { text: '', link: '/3.编程思维体系构建/' },
                  { text: '', link: '/3.编程思维体系构建/' },
                  { text: '', link: '/3.编程思维体系构建/' },
                ]
              },
              {
                text: '3.6.5关于CS61A',
                collapsed: true,
                items: [
                  { text: '3.6.5关于CS61A', link: '/3.编程思维体系构建/3.6.5关于CS61A' },
                  { text: '3.6.5.1lab00：让我们开始吧', link: '/3.编程思维体系构建/3.6.5.1lab00：让我们开始吧' },
                ]
              },
              { text: '3.X 聊聊设计模式和程序设计', link: '/3.编程思维体系构建/3.X 聊聊设计模式和程序设计' },
              {
                text: '3.Y 附加模块：Linux',
                collapsed: true,
                items: [
                  { text: '3.Y 附加模块：Linux', link: '/3.编程思维体系构建/3.Y 附加模块：Linux' },
                  { text: '3.Y.1VMware的安装与安装Ubuntu22.04系统', link: '/3.编程思维体系构建/3.Y.1VMware的安装与安装Ubuntu22.04系统' },
                  { text: '3.Y.2WSL的安装', link: '/3.编程思维体系构建/3.Y.2WSL的安装' },
                  { text: '3.Y.3Linux初探索', link: '/3.编程思维体系构建/3.Y.3Linux初探索' },
                  { text: '3.Y.4Vim初探索', link: '/3.编程思维体系构建/3.Y.4Vim初探索' },
                  { text: '3.Y.5linux小任务', link: '/3.编程思维体系构建/3.Y.5linux小任务' },
                ]
              }
            ]
          }
        ]
      },
      {
        text: 'Contributors',
        link: '/contributors'
      }
    ],
    socialLinks: [
      { icon: 'github', link: 'https://github.com/camera-2018/hdu-cs-wiki' }
    ],
    footer: {
      message: 'Released under the MIT License.',
      copyright: 'Copyright © 2023-present Evan You && HDU 计算机科协 && ALL 协作者'
    },
    lastUpdatedText: '上次更改',
    docFooter: {
      prev: '上一小节',
      next: '下一小节'
    },
    // localSearch: true, # 尚未发布的本地搜索，撅撅子
  },

})

